Repository: Belfagor2005/EPGImport-DreamOs
Catalog: src/EPGImport/locale/*/LC_MESSAGES/EPGImport.po
Languages: it

source: Add Provider
it: Aggiungi fornitore

source: Add Channel
it: Aggiungi canale

source: press OK to save list
it: premere OK per salvare l'elenco

source: Ignore services list(press OK to save)
it: Ignora elenco servizi (premi OK per salvare)

source: Really delete all list?
it: Eliminare davvero tutta la lista?

source: Delete selected
it: Elimina selezionato

source: Delete all
it: Elimina tutto

source: Channel Selection
it: Selezione canale

source: All services provider
it: Fornitore di tutti i servizi

source: Select action
it: Seleziona azione

source: always
it: sempre

source: only manual boot
it: solo avvio manuale

source: only automatic boot
it: solo avvio automatico

source: never
it: mai

source: wake up and import
it: accendi e importa

source: skip the import
it: salta importazione

source: Press OK
it: Premi OK

source: Monday
it: Lunedì

source: Tuesday
it: Martedì

source: Wednesday
it: Mercoledì

source: Thursday
it: Giovedì

source: Friday
it: Venerdì

source: Saturday
it: Sabato

source: Sunday
it: Domenica

source: EPG Import Configuration
it: Configurazione di EPG Import

source: Cancel
it: Annulla

source: Save
it: Salva

source: Manual
it: Manuale

source: Sources
it: Sorgenti

source: Filtering: %s Please wait!
it: Filtraggio: %s Prego attendere!

source: Importing: %s %s events
it: Importazione: %s %s eventi

source: Last import: %s events
it: Ultima importazione: %s eventi

source: Automatic import EPG
it: Importazione automatica EPG

source: When enabled, it allows you to schedule an automatic EPG update at the given days and time.
it: Se abilitato, consente di pianificare un aggiornamento automatico dell'EPG nei giorni e all'ora specificati.

source: Path DB EPG
it: Percorso DB EPG

source: Specify the path folder for save EPG.dat file.
it: Specificare la cartella del percorso in cui salvare il file EPG.dat.

source: Source EPG
it: Sorgenti EPG

source: Specify the source for EPG.
it: Specificare i sorgenti dell'EPG.

source: Automatic start time
it: Orario di avvio automatico

source: Specify the time for the automatic EPG update.
it: Specificare l'orario per l'aggiornamento automatico EPG.

source: When in deep standby
it: Quando è spento

source: Choose the action to perform when the box is in deep standby and the automatic EPG update should normally start.
it: Scegli l'azione da eseguire quando il ricevitore è spento e l'aggiornamento automatico dell'EPG dovrebbe normalmente iniziare.

source: Choice days for start import
it: Seleziona i giorni di avvio importazione

source: You can select the day(s) when the EPG update must be performed.
it: Puoi selezionare i giorni in cui deve essere eseguito l'aggiornamento EPG.

source: Return to deep standby after import
it: Spegni completamente dopo l'importazione

source: This will turn back waked up box into deep-standby after automatic EPG import.
it: Accende il ricevitore, importa automaticamente l'EPG, spegne il ricevitore.

source: Standby at startup
it: Standby all'avvio

source: The waked up box will be turned into standby after automatic EPG import wake up.
it: Il ricevitore verrà messo in standby dopo l'accensione automatica dell'importazione EPG.

source: Hours after which the import is repeated
it: Ore dopo le quali l'importazione viene ripetuta

source: Number of hours (1-23, or 0 for no repeat) after which the import is repeated. This value is not saved and will be reset when the GUI restarts.
it: Numero di ore (1-23 o 0 per nessuna ripetizione) dopo le quali viene ripetuta l'importazione. Questo valore non viene salvato e verrà reimpostato al riavvio della GUI.

source: Start import after booting up
it: Avvia importazione dopo il boot

source: Specify in which case the EPG must be automatically updated after the box has booted.
it: Specifica in quale caso l'EPG deve essere aggiornato automaticamente dopo l'avvio del ricevitore.

source: Consider setting "Days Profile"
it: Valuta la possibilità di impostare "Profilo giorni"

source: When you decide to import the EPG after the box booted mention if the "days profile" must be take into consideration or not.
it: Quando decidi di importare l'EPG dopo l'avvio del ricevitore indica se il "Profilo giorni" deve essere preso in considerazione oppure no.

source: Skip import on restart GUI
it: Salta importazione al riavvio della GUI

source: When you restart the GUI you can decide to skip or not the EPG data import.
it: Quando riavvii la GUI puoi decidere di saltare o meno l'importazione dei dati EPG.

source: Start import after standby
it: Avvia importazione dopo lo standby

source: Start import after resuming from standby mode.
it: Avvia l'importazione dopo essere uscito dalla modalità standby.

source: Load EPG only services in bouquets
it: Carica solo i servizi EPG nei bouquet

source: To save memory you can decide to only load EPG data for the services that you have in your bouquet files.
it: Per risparmiare memoria puoi decidere di caricare solo i dati EPG per i servizi che hai nei bouquet.

source: Load EPG only for IPTV channels
it: Carica EPG solo per i canali IPTV

source: To save memory you can decide to load EPG data only for theIPTV channels.
it: Per risparmiare memoria puoi decidere di caricare solo i dati EPG per i canali IPTV.

source: Show "EPGimport now" in extensions
it: Mostra "EPGImport Ora" nelle estensioni

source: Display a shortcut "EPG import now" in the extension menu. This menu entry will immediately start the EPG update process when selected.
it: Visualizza una scorciatoia "Importa EPG ora" nel menu delle estensioni. Questa voce di menu avvierà immediatamente il processo di aggiornamento EPG quando selezionata.

source: Show "EPGImport" in plugins
it: Mostra "EPGImport" in plugins

source: Display a shortcut "EPG import" in the plugins browser.
it: Visualizza una scorciatoia "Importazione EPG" nel browser dei plugin.

source: Show "EPGimport" in epg menu
it: Mostra "EPGImport" nel menu epg

source: Display a shortcut "EPG import" in your STB epg menu screen. This allows you to access the configuration.
it: Visualizza una scorciatoia "Importazione EPG" nella schermata del menu epg del ricevitore. Questo ti consente di accedere alla configurazione.

source: Load long descriptions up to X days
it: Carica descrizioni lunghe fino a X giorni

source: Define the number of days that you want to get the full EPG data, reducing this number can help you to save memory usage on your box. But you are also limited with the EPG provider available data. You will not have 15 days EPG if it only provide 7 days data.
it: Definisci il numero di giorni di cui desideri ottenere i dati EPG completi. Ridurre questo numero può aiutarti a risparmiare utilizzo della memoria sul ricevitore. Ma sei anche limitato con i dati disponibili del fornitore EPG. Non avrai un EPG di 15 giorni se fornisce solo dati di 7 giorni.

source: Run AutoTimer after import
it: Esegui AutoTimer dopo l'importazione

source: You can start automatically the plugin AutoTimer after the EPG data update to have it refreshing its scheduling after EPG data refresh.
it: Puoi avviare automaticamente il plugin AutoTimer dopo l'aggiornamento dei dati EPG per fare in modo che aggiorni la sua pianificazione dopo l'aggiornamento dei dati EPG.

source: Delete current EPG before import
it: Cancellazione dell'EPG attuale prima dell'importazione

source: This will clear the current EPG data in memory before updating the EPG data. This allows you to always have a clean new EPG with the latest EPG data, for example in case of program changes between refresh, otherwise EPG data are cumulative.
it: Cancella i dati EPG in memoria prima di aggiornare i dati EPG. Consente di avere sempre un nuovo EPG pulito con i dati EPG più recenti, ad esempio in caso di modifiche al programma tra un aggiornamento e l'altro, altrimenti i dati EPG sono cumulativi.

source: Also apply "channel id" filtering on custom.channels.xml
it: Applica anche il filtro "ID canale" su custom.channels.xml

source: This is for advanced users that are using the channel id filtering feature. If enabled, the filter rules defined into /etc/epgimport/channel_id_filter.conf will also be applied on your /etc/epgimport/custom.channels.xml file.
it: Per gli utenti avanzati che utilizzano la funzione di filtraggio dell'ID canale. Se abilitate, le regole di filtro definite in /etc/epgimport/channel_id_filter.conf verranno applicate anche al file /etc/epgimport/custom.channels.xml.

source: Execute shell command before import EPG
it: Esegui comando shell prima di importare EPG

source: When enabled, then you can run the desired script before starting the import, after which the import of the EPG will begin.
it: Se abilitato, è possibile eseguire lo script desiderato prima di avviare l'importazione, dopodiché inizierà l'importazione dell'EPG.

source: Shell command name
it: Nome del comando shell

source: Enter shell command name.
it: Inserisci il nome del comando shell.

source: Settings saved successfully !
it: Impostazioni salvate con successo!

source: Choose Directory:
it: Scegli la Directory:

source: Choose directory
it: Scegli la directory

source: SELECT YOUR CHOICE
it: SELEZIONA LA TUA SCELTA

source: Last import: %s %s, %d events
it: Ultima importazione: %s %s, %d eventi

source: Show log
it: Mostra registro

source: Ignore services list
it: Ignora elenco servizi

source: EPGImport Import of epg data is still in progress. Please wait.
it: EPG Import Importazione dati EPG in corso...

source: No active EPG sources found, nothing to do
it: Nessuna sorgente EPG attiva trovata, non posso fare niente

source: EPGImport Import of epg data will start. This may take a few minutes. Is this ok?
it: EPG Import L'importazione dei dati EPG sta per iniziare. Ci vorrà qualche minuto. Procedo?

source: EPGImport Plugin Failed to start:
it: Plugin EPG Import Avvio non riuscito:

source: Import
it: Importa

source: Import from Git
it: Importa da Git

source: EPG Import Sources
it: Sorgenti di EPG Import

source: Do you want to update Source now? Wait for the import successful message!
it: Vuoi aggiornare Source ora? Attendi il messaggio di importazione riuscita!

source: Import failed with error: {}
it: Import fallito con errore: {}

source: Update Aborted!
it: Aggiornamento interrotto!

source: No sources found after update!
it: Nessuna fonte trovata dopo l'aggiornamento!

source: Sources updated successfully!
it: Fonti aggiornate con successo!

source: Error refreshing sources: {}
it: Errore durante l'aggiornamento delle fonti: {}

source: EPG database was emptied
it: Il database EPG è stato svuotato

source: Days Profile
it: Profilo giorni

source: You may not use this settings! At least one day a week should be included!
it: Non puoi usare queste impostazioni! Dovrebbe essere incluso almeno un giorno della settimana!

source: Clear
it: Cancella

source: EPG Import Log
it: Registro di EPG Import

source: Write to /tmp/epgimport.log
it: Scrivi in ​​/tmp/epgimport.log

source: Last import:
it: Ultima importazione:

source: events
it: eventi

source: Import of epg data will start. This may take a few minutes. Is this ok?
it: Verrà avviata l'importazione dei dati EPG. L'operazione potrebbe richiedere alcuni minuti. Procedo?

source: EPG Import finished, %d events
it: EPG Import ha terminato, %d eventi

source: You must restart Enigma2 to load the EPG data, is this OK?
it: Devi riavviare Enigma2 per caricare i dati EPG, procedo?

source: No source file found !
it: Nessun file sorgente trovato!

source: EPG-Importer
it: EPGImport

source: Automated EPG Importer
it: Importatore automatizzato di EPG

source: EPGImport now
it: EPG Import Ora
